In [2]:
import pandas as pd

In [3]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [4]:
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [5]:
y = df[['Department']]
y

        Department
0  Architect Group
1   Software Group
2      Design Team
3   Infrastructure

In [6]:
type(y)

pandas.core.frame.DataFrame

In [7]:
z = df[['ID', 'Department', 'Salary']]
z

   ID       Department  Salary
0   1  Architect Group  100000
1   2   Software Group   80000
2   3      Design Team   50000
3   4   Infrastructure   60000

In [8]:
df.iloc[0, 0]

'Rose'

In [9]:
df.iloc[0,2]

'Architect Group'

In [10]:
df.loc[0, 'Salary']

100000

In [11]:
df2=df
df2=df2.set_index("Name")

In [12]:
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [13]:
df2.loc['Jane', 'Salary']

50000

In [14]:
df2.loc['Jane', 'Department']

'Design Team'

In [15]:
df2.iloc[3,2]

60000

In [16]:
df2.iloc[3,2]

60000

In [17]:
df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [18]:
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [19]:
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

In [20]:
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

In [21]:
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure